<?php

namespace Controllers;

use core\Controller;
use core\Template;

/**
 * Контролер для обробки основних сторінок сайту.
 *
 * Цей контролер відповідає за відображення головної сторінки та сторінки з політикою конфіденційності.
 */
class SiteController extends Controller
{
    /**
     * Дія для відображення головної сторінки.
     *
     * Повертає шаблон головної сторінки.
     *
     * @return array Масив з HTML-контентом головної сторінки.
     */
    public function actionIndex()
    {
        // Відображення головної сторінки
        return $this->render();
    }

    /**
     * Дія для відображення сторінки політики конфіденційності.
     *
     * Повертає шаблон сторінки політики конфіденційності.
     *
     * @return array Масив з HTML-контентом сторінки політики конфіденційності.
     */
    public function actionPrivacyPolicy()
    {
        // Відображення сторінки політики конфіденційності
        return $this->render();
    }
}
