<?php
/**
 * Реєстрація автозавантажувача класів та обробка маршруту
 *
 * Цей скрипт відповідає за:
 * 1. Автоматичне завантаження класів.
 * 2. Обробку маршруту, який передається через GET параметр 'route'.
 * 3. Запуск основної логіки системи.
 *
 * @var string $route Маршрут, отриманий з параметра GET або за замовчуванням порожній рядок
 * @var \core\Core $core Основний об'єкт системи, який виконує ініціалізацію та обробку запиту
 */

// Реєстрація автозавантажувача класів
spl_autoload_register(static function ($className) {
    $path = str_replace('\\', '/', $className.'.php');
    if(file_exists($path))
        include_once($path);
});

// Визначення маршруту з параметра GET або порожнього значення за замовчуванням
if(isset($_GET['route']))
    $route = $_GET['route'];
else
    $route = '';

// Ініціалізація та запуск основної логіки системи
$core = \core\Core::get(); // Отримання об'єкта основної системи
$core->run($route); // Запуск системи з переданим маршрутом
$core->finish(); // Завершення роботи системи
?>
