<?php
/**
 * Масив конфігурацій для підключення до бази даних.
 *
 * Цей масив містить параметри для підключення до бази даних, такі як хост,
 * назва бази даних, логін і пароль. Використовується для налаштування
 * з'єднання з базою даних у проекті.
 *
 * @var array $Config Масив з налаштуваннями підключення до бази даних.
 *
 * Параметри:
 * - dbHost: Хост для підключення до бази даних.
 * - dbName: Назва бази даних.
 * - dbLogin: Логін для підключення до бази даних.
 * - dbPass: Пароль для підключення до бази даних.
 */
$Config[] = [
    'dbHost' => 'localhost',     /**< Хост бази даних (може бути IP або домен) */
    'dbName' => 'itlabportal',   /**< Назва бази даних */
    'dbLogin' => 'cmsITLab',     /**< Логін для підключення до бази даних */
    'dbPass' => 'DruEdC1iEKHTj!CW' /**< Пароль для підключення до бази даних */
];